const array = []; // пустой массив

const arr1 = [1, 2, 3]; // массив с тремя числовыми элементами

const arr2 = ['vscode', 'telegram', 'AppStore']; // массив с тремя строковыми элементами

const arr3 = [4, 5, 6, 'apple', 'honor', 'samsung']; // массив с тремя строковыми и с тремя числовыми элементами

const arr4 = ['Мухаммад', 'Мухаммад2', 'Мансур', 'Хамзат', 'Минкаил']; // массив с именами всех твоих одногруппников

const arr5 = [4, 'word', null, undefined, true, false]; //массив, в котором есть число, строка, null, undefined, true и false

const arr6 = [[], [], []]; // массив, внутри которого три пустых массива

const arr7 = [[7, 8, 9], [10, 11, 12]]; // массив, внутри которого два массива, а внутри каждого вложенного массива любые три числа
